# AddPoint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexStreamPoint..::..AddPoint Method
IndexStreamPoint Class See Also
---
Inserts a IndexPoint into the stream and associated buffer.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void AddPoint(
	IndexPoint point
)
```

Visual Basic
---
```text
Public Sub AddPoint ( _
	point As IndexPoint _
)
```

Visual C++
---
```text
public:
void AddPoint(
	IndexPoint^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB.DirectContext3D..::..IndexPoint The point to be inserted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace